src/note/ws/4000/4005_ex_003_req_elabora.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <ns2:Richiesta4005 xmlns:ns2="http://sogei.it/ANPR/4000estrazione">
         <testataRichiesta>
            <idOperazioneComune>20190520003</idOperazioneComune>
            <codMittente>040007</codMittente>
            <codDestinatario>ANPR02</codDestinatario>
            <operazioneRichiesta>4005</operazioneRichiesta>
            <dataOraRichiesta>2019-05-20T12:15:40.053+02:00</dataOraRichiesta>
            <tipoOperazione>C</tipoOperazione>
            <tipoInvio>TEST</tipoInvio>
         </testataRichiesta>
         <elaborazione>
         	<!-- dettaglioDati per le notifiche puo' valere
         		solo ID o RISPOSTA. In caso di valori diversi
         		il comportamento e' lo stesso di RISPOSTA (default) -->
            <dettaglioDati>RISPOSTA</dettaglioDati>
            <ricercaElenchiRichieste>
               <statoLavorazione>9</statoLavorazione>
               <operazioneRichiesta>N031</operazioneRichiesta>
               <periodoRiferimentoRichieste>
                  <dataOraIniziale>2016-03-01T12:15:40.053+01:00</dataOraIniziale>
                  <dataOraFinale>2019-04-16T12:15:40.053+02:00</dataOraFinale>
               </periodoRiferimentoRichieste>
            </ricercaElenchiRichieste>
         </elaborazione>
      </ns2:Richiesta4005>
   </soapenv:Body>
</soapenv:Envelope>